// SPDX-License-Identifier: GPL-2.0+
/*
 * Nexell SoC sound PDM/PCM driver
 * Copyright (c) 2018 JungHyun Kim <jhkim@nexell.co.kr>
 */

#include <linux/kernel.h>
#include <linux/module.h>
#include <linux/delay.h>
#include <linux/clk.h>
#include <linux/clk-provider.h>
#include <linux/of_address.h>
#include <linux/io.h>
#include <linux/mfd/syscon.h>
#include <sound/soc.h>

#define PDM_CLK_ENB		(1<<2 | 1<<0)
#define PDM_CLK_DIV_L(x)	((x & 0xFF) << 8)
#define PDM_CLK_DIV_H(x)	((x & 0xFF) << 16)
#define PDM_LOCK_CNT(x)		(x & ((1<<23) - 1))
#define PDM_LOCK_1ST_ENB	(1<<30)
#define PDM_LOCK_LRCK		(1<<31)
#define PDM_CIC_CH(x)		((x & 0x03) << 0)
#define PDM_CIC_COMB(x)		((x & 0x07) << 4)
#define PDM_CIC_INTG(x)		((x & 0x07) << 8)
#define PDM_CIC_SHIFT(x)	((x & 0x0f) << 16)
#define PDM_CIC_DIV(x)		((x & 0x3f) << 24)
#define PDM_SRC_PAD(x, ch)	((x & 0x3) << (ch * 4))
#define PDM_PARAMS_HBP(x)	(x ? 1<<30 : 0<<30)
#define PDM_PARAMS_OUT(x)	(x ? 1<<31 : 0<<31)
#define PDM_PARAMS_SIZE(s)	((s/4) & 0xFF)
#define IRQ_TOUT_ENB		(1<<1 | 1<<0)
#define IRQ_TOUT_PEND		(1<<2)
#define IRQ_LDET_ENB		(1<<5 | 1<<4) /* sync detect */
#define IRQ_LDET_PEND		(1<<6)
#define IRQ_DMA_ENB		(1<<9 | 1<<8) /* (0<<9 | 1<<8)  */
#define IRQ_DMA_MASK		(1<<9 | 1<<8) /* (1<<9 | 1<<8)  */
#define IRQ_DMA_PEND		(1<<10)

#define IRQ_MASK_PEND		(IRQ_TOUT_PEND | IRQ_LDET_PEND | IRQ_DMA_PEND)

#define	MEM_BURST_SIZE		(8 * 8) /* 64bit 8 burst :64byte */
#define	MEM_SIZE		(0x4000)
#define	MEM_CIC_SIZE		(199 * 4)
#define MAX_PDM_PADS		4
#define MAX_REF_CH		3
#define PDM_LOCK_MAX		(1<<(23 - 1))
#define _word_(x)		(x/4)

struct pdm_fir_reg {
	u32 rd_offs;	/* 0x100 */
	u32 rd_end;	/* 0x104 */
	u32 wr_offs;	/* 0x108 */
	u32 wr_end;	/* 0x10c */
	u32 coef_offs;	/* 0x110 */
	u32 coef_num;	/* 0x114 */
	u32 resv[2];
};

struct pdm_reg {
	u32 ctrl;	/* 0x00 */
	u32 pdm_clk;	/* 0x04 */
	u32 pdm_lock;	/* 0x08 */
	u32 pdm_tout;	/* 0x0c */
	u32 pdm_src;	/* 0x10 */
	u32 cic_cfg;	/* 0x14 */
	u32 cic_pos_v;	/* 0x18 */
	u32 cic_neg_v;	/* 0x1c */
	u32 dma_size;	/* 0x20 */
	u32 dma_addr0;	/* 0x24 */
	u32 dma_addr1;	/* 0x28 */
	u32 fir_num;	/* 0x2c */
	u32 cic_offs;	/* 0x30 */
	u32 cic_end;	/* 0x34 */
	u32 intr;	/* 0x38 */
	u32 mem_sleep;	/* 0x3c */
	u32 resv[50-2];
	struct pdm_fir_reg firs[6];
};

enum pdm_sync_type {
	pdm_sync_none, /* Not sync, source system clk */
	pdm_sync_mclk, /* sync iis mclk, source mclk */
	pdm_sync_lrck, /* sync iis lrck, source system clk */
};

struct pdm_cic_cfg {
	int comb_stages;
	int integrators;
	int shfit, divide;
	int posv, negv;
};

struct pdm_coeff_cfg {
	bool hbf; /* Halfband Filter or LowPass Filter */
	u32 *buffer;
	int size;
};

struct pdm_fir_cfg {
	struct pdm_coeff_cfg *coef;
	int num_coefs;
};

struct nx_pdm_data {
	struct device *dev;
	struct pdm_reg *base;
	void __iomem *mem;
	dma_addr_t addr;
	int irq;
	int channel;
	struct clk *clk;
	struct clk *clk_axi;
	struct regmap *syscon;
	enum pdm_sync_type sync_type;
	int ref_iis;
	unsigned int sys_freq;
	unsigned int ref_freq;
	int ref_sample_rate;
	int sample_rate;
	int strobe_hz;
	unsigned int timeout;
	int num_pads;
	int i_pads[MAX_PDM_PADS];
	struct pdm_cic_cfg cic;
	struct pdm_fir_cfg fir;
	bool running;
};
